GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.inc
// Register: DMA2DSA
#define DMA2DSA DMA2DSA
DMA2DSA                                  equ 03BD0h

// Register: DMA2DSAL
#define DMA2DSAL DMA2DSAL
DMA2DSAL                                 equ 03BD0h
// bitfield definitions
DMA2DSAL_DSA_POSN                        equ 0000h
DMA2DSAL_DSA_POSITION                    equ 0000h
DMA2DSAL_DSA_SIZE                        equ 0008h
DMA2DSAL_DSA_LENGTH                      equ 0008h
DMA2DSAL_DSA_MASK                        equ 00FFh
DMA2DSAL_DSA0_POSN                       equ 0000h
DMA2DSAL_DSA0_POSITION                   equ 0000h
DMA2DSAL_DSA0_SIZE                       equ 0001h
DMA2DSAL_DSA0_LENGTH                     equ 0001h
DMA2DSAL_DSA0_MASK                       equ 0001h
DMA2DSAL_DSA1_POSN                       equ 0001h
DMA2DSAL_DSA1_POSITION                   equ 0001h
DMA2DSAL_DSA1_SIZE                       equ 0001h
DMA2DSAL_DSA1_LENGTH                     equ 0001h
DMA2DSAL_DSA1_MASK                       equ 0002h
DMA2DSAL_DSA2_POSN                       equ 0002h
DMA2DSAL_DSA2_POSITION                   equ 0002h
DMA2DSAL_DSA2_SIZE                       equ 0001h
DMA2DSAL_DSA2_LENGTH                     equ 0001h
DMA2DSAL_DSA2_MASK                       equ 0004h
DMA2DSAL_DSA3_POSN                       equ 0003h
DMA2DSAL_DSA3_POSITION                   equ 0003h
DMA2DSAL_DSA3_SIZE                       equ 0001h
DMA2DSAL_DSA3_LENGTH                     equ 0001h
DMA2DSAL_DSA3_MASK                       equ 0008h
DMA2DSAL_DSA4_POSN                       equ 0004h
DMA2DSAL_DSA4_POSITION                   equ 0004h
DMA2DSAL_DSA4_SIZE                       equ 0001h
DMA2DSAL_DSA4_LENGTH                     equ 0001h
DMA2DSAL_DSA4_MASK                       equ 0010h
DMA2DSAL_DSA5_POSN                       equ 0005h
DMA2DSAL_DSA5_POSITION                   equ 0005h
DMA2DSAL_DSA5_SIZE                       equ 0001h
DMA2DSAL_DSA5_LENGTH                     equ 0001h
DMA2DSAL_DSA5_MASK                       equ 0020h
DMA2DSAL_DSA6_POSN                       equ 0006h
DMA2DSAL_DSA6_POSITION                   equ 0006h
DMA2DSAL_DSA6_SIZE                       equ 0001h
DMA2DSAL_DSA6_LENGTH                     equ 0001h
DMA2DSAL_DSA6_MASK                       equ 0040h
DMA2DSAL_DSA7_POSN                       equ 0007h
DMA2DSAL_DSA7_POSITION                   equ 0007h
DMA2DSAL_DSA7_SIZE                       equ 0001h
DMA2DSAL_DSA7_LENGTH                     equ 0001h
DMA2DSAL_DSA7_MASK                       equ 0080h
DMA2DSAL_DMA2DSA_POSN                    equ 0000h
DMA2DSAL_DMA2DSA_POSITION                equ 0000h
DMA2DSAL_DMA2DSA_SIZE                    equ 0008h
DMA2DSAL_DMA2DSA_LENGTH                  equ 0008h
DMA2DSAL_DMA2DSA_MASK                    equ 00FFh
DMA2DSAL_DMA2DSA0_POSN                   equ 0000h
DMA2DSAL_DMA2DSA0_POSITION               equ 0000h
DMA2DSAL_DMA2DSA0_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA0_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA0_MASK                   equ 0001h
DMA2DSAL_DMA2DSA1_POSN                   equ 0001h
DMA2DSAL_DMA2DSA1_POSITION               equ 0001h
DMA2DSAL_DMA2DSA1_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA1_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA1_MASK                   equ 0002h
DMA2DSAL_DMA2DSA2_POSN                   equ 0002h
DMA2DSAL_DMA2DSA2_POSITION               equ 0002h
DMA2DSAL_DMA2DSA2_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA2_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA2_MASK                   equ 0004h
DMA2DSAL_DMA2DSA3_POSN                   equ 0003h
DMA2DSAL_DMA2DSA3_POSITION               equ 0003h
DMA2DSAL_DMA2DSA3_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA3_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA3_MASK                   equ 0008h
DMA2DSAL_DMA2DSA4_POSN                   equ 0004h
DMA2DSAL_DMA2DSA4_POSITION               equ 0004h
DMA2DSAL_DMA2DSA4_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA4_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA4_MASK                   equ 0010h
DMA2DSAL_DMA2DSA5_POSN                   equ 0005h
DMA2DSAL_DMA2DSA5_POSITION               equ 0005h
DMA2DSAL_DMA2DSA5_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA5_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA5_MASK                   equ 0020h
DMA2DSAL_DMA2DSA6_POSN                   equ 0006h
DMA2DSAL_DMA2DSA6_POSITION               equ 0006h
DMA2DSAL_DMA2DSA6_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA6_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA6_MASK                   equ 0040h
DMA2DSAL_DMA2DSA7_POSN                   equ 0007h
DMA2DSAL_DMA2DSA7_POSITION               equ 0007h
DMA2DSAL_DMA2DSA7_SIZE                   equ 0001h
DMA2DSAL_DMA2DSA7_LENGTH                 equ 0001h
DMA2DSAL_DMA2DSA7_MASK                   equ 0080h

// Register: DMA2DSAH
#define DMA2DSAH DMA2DSAH
DMA2DSAH                                 equ 03BD1h
// bitfield definitions
DMA2DSAH_DSA_POSN                        equ 0000h
DMA2DSAH_DSA_POSITION                    equ 0000h
DMA2DSAH_DSA_SIZE                        equ 0008h
DMA2DSAH_DSA_LENGTH                      equ 0008h
DMA2DSAH_DSA_MASK                        equ 00FFh
DMA2DSAH_DSA8_POSN                       equ 0000h
DMA2DSAH_DSA8_POSITION                   equ 0000h
DMA2DSAH_DSA8_SIZE                       equ 0001h
DMA2DSAH_DSA8_LENGTH                     equ 0001h
DMA2DSAH_DSA8_MASK                       equ 0001h
DMA2DSAH_DSA9_POSN                       equ 0001h
DMA2DSAH_DSA9_POSITION                   equ 0001h
DMA2DSAH_DSA9_SIZE                       equ 0001h
DMA2DSAH_DSA9_LENGTH                     equ 0001h
DMA2DSAH_DSA9_MASK                       equ 0002h
DMA2DSAH_DSA10_POSN                      equ 0002h
DMA2DSAH_DSA10_POSITION                  equ 0002h
DMA2DSAH_DSA10_SIZE                      equ 0001h
DMA2DSAH_DSA10_LENGTH                    equ 0001h
DMA2DSAH_DSA10_MASK                      equ 0004h
DMA2DSAH_DSA11_POSN                      equ 0003h
DMA2DSAH_DSA11_POSITION                  equ 0003h
DMA2DSAH_DSA11_SIZE                      equ 0001h
DMA2DSAH_DSA11_LENGTH                    equ 0001h
DMA2DSAH_DSA11_MASK                      equ 0008h
DMA2DSAH_DSA12_POSN                      equ 0004h
DMA2DSAH_DSA12_POSITION                  equ 0004h
DMA2DSAH_DSA12_SIZE                      equ 0001h
DMA2DSAH_DSA12_LENGTH                    equ 0001h
DMA2DSAH_DSA12_MASK                      equ 0010h
DMA2DSAH_DSA13_POSN                      equ 0005h
DMA2DSAH_DSA13_POSITION                  equ 0005h
DMA2DSAH_DSA13_SIZE                      equ 0001h
DMA2DSAH_DSA13_LENGTH                    equ 0001h
DMA2DSAH_DSA13_MASK                      equ 0020h
DMA2DSAH_DSA14_POSN                      equ 0006h
DMA2DSAH_DSA14_POSITION                  equ 0006h
DMA2DSAH_DSA14_SIZE                      equ 0001h
DMA2DSAH_DSA14_LENGTH                    equ 0001h
DMA2DSAH_DSA14_MASK                      equ 0040h
DMA2DSAH_DSA15_POSN                      equ 0007h
DMA2DSAH_DSA15_POSITION                  equ 0007h
DMA2DSAH_DSA15_SIZE                      equ 0001h
DMA2DSAH_DSA15_LENGTH                    equ 0001h
DMA2DSAH_DSA15_MASK                      equ 0080h
DMA2DSAH_DMA2DSA_POSN                    equ 0000h
DMA2DSAH_DMA2DSA_POSITION                equ 0000h
DMA2DSAH_DMA2DSA_SIZE                    equ 0008h
DMA2DSAH_DMA2DSA_LENGTH                  equ 0008h
DMA2DSAH_DMA2DSA_MASK                    equ 00FFh
DMA2DSAH_DMA2DSA8_POSN                   equ 0000h
DMA2DSAH_DMA2DSA8_POSITION               equ 0000h
DMA2DSAH_DMA2DSA8_SIZE                   equ 0001h
DMA2DSAH_DMA2DSA8_LENGTH                 equ 0001h
DMA2DSAH_DMA2DSA8_MASK                   equ 0001h
DMA2DSAH_DMA2DSA9_POSN                   equ 0001h
DMA2DSAH_DMA2DSA9_POSITION               equ 0001h
DMA2DSAH_DMA2DSA9_SIZE                   equ 0001h
DMA2DSAH_DMA2DSA9_LENGTH                 equ 0001h
DMA2DSAH_DMA2DSA9_MASK                   equ 0002h
DMA2DSAH_DMA2DSA10_POSN                  equ 0002h
DMA2DSAH_DMA2DSA10_POSITION              equ 0002h
DMA2DSAH_DMA2DSA10_SIZE                  equ 0001h
DMA2DSAH_DMA2DSA10_LENGTH                equ 0001h
DMA2DSAH_DMA2DSA10_MASK                  equ 0004h
DMA2DSAH_DMA2DSA11_POSN                  equ 0003h
DMA2DSAH_DMA2DSA11_POSITION              equ 0003h
DMA2DSAH_DMA2DSA11_SIZE                  equ 0001h
DMA2DSAH_DMA2DSA11_LENGTH                equ 0001h
DMA2DSAH_DMA2DSA11_MASK                  equ 0008h
DMA2DSAH_DMA2DSA12_POSN                  equ 0004h
DMA2DSAH_DMA2DSA12_POSITION              equ 0004h
DMA2DSAH_DMA2DSA12_SIZE                  equ 0001h
DMA2DSAH_DMA2DSA12_LENGTH                equ 0001h
DMA2DSAH_DMA2DSA12_MASK                  equ 0010h
DMA2DSAH_DMA2DSA13_POSN                  equ 0005h
DMA2DSAH_DMA2DSA13_POSITION              equ 0005h
DMA2DSAH_DMA2DSA13_SIZE                  equ 0001h
DMA2DSAH_DMA2DSA13_LENGTH                equ 0001h
DMA2DSAH_DMA2DSA13_MASK                  equ 0020h
DMA2DSAH_DMA2DSA14_POSN                  equ 0006h
DMA2DSAH_DMA2DSA14_POSITION              equ 0006h
DMA2DSAH_DMA2DSA14_SIZE                  equ 0001h
DMA2DSAH_DMA2DSA14_LENGTH                equ 0001h
DMA2DSAH_DMA2DSA14_MASK                  equ 0040h
DMA2DSAH_DMA2DSA15_POSN                  equ 0007h
DMA2DSAH_DMA2DSA15_POSITION              equ 0007h
DMA2DSAH_DMA2DSA15_SIZE                  equ 0001h
DMA2DSAH_DMA2DSA15_LENGTH                equ 0001h
DMA2DSAH_DMA2DSA15_MASK                  equ 0080h

// Register: DMA2SCNT
#define DMA2SCNT DMA2SCNT
DMA2SCNT                                 equ 03BD2h

// Register: DMA2SCNTL
#define DMA2SCNTL DMA2SCNTL
DMA2SCNTL                                equ 03BD2h
// bitfield definitions
DMA2SCNTL_SCNT_POSN                      equ 0000h
DMA2SCNTL_SCNT_POSITION                  equ 0000h
DMA2SCNTL_SCNT_SIZE                      equ 0008h
DMA2SCNTL_SCNT_LENGTH                    equ 0008h
DMA2SCNTL_SCNT_MASK                      equ 00FFh
DMA2SCNTL_SCNT0_POSN                     equ 0000h
DMA2SCNTL_SCNT0_POSITION                 equ 0000h
DMA2SCNTL_SCNT0_SIZE                     equ 0001h
DMA2SCNTL_SCNT0_LENGTH                   equ 0001h
DMA2SCNTL_SCNT0_MASK                     equ 0001h
DMA2SCNTL_SCNT1_POSN                     equ 0001h
DMA2SCNTL_SCNT1_POSITION                 equ 0001h
DMA2SCNTL_SCNT1_SIZE                     equ 0001h
DMA2SCNTL_SCNT1_LENGTH                   equ 0001h
DMA2SCNTL_SCNT1_MASK                     equ 0002h
DMA2SCNTL_SCNT2_POSN                     equ 0002h
DMA2SCNTL_SCNT2_POSITION                 equ 0002h
DMA2SCNTL_SCNT2_SIZE                     equ 0001h
DMA2SCNTL_SCNT2_LENGTH                   equ 0001h
DMA2SCNTL_SCNT2_MASK                     equ 0004h
DMA2SCNTL_SCNT3_POSN                     equ 0003h
DMA2SCNTL_SCNT3_POSITION                 equ 0003h
DMA2SCNTL_SCNT3_SIZE                     equ 0001h
DMA2SCNTL_SCNT3_LENGTH                   equ 0001h
DMA2SCNTL_SCNT3_MASK                     equ 0008h
DMA2SCNTL_SCNT4_POSN                     equ 0004h
DMA2SCNTL_SCNT4_POSITION                 equ 0004h
DMA2SCNTL_SCNT4_SIZE                     equ 0001h
DMA2SCNTL_SCNT4_LENGTH                   equ 0001h
DMA2SCNTL_SCNT4_MASK                     equ 0010h
DMA2SCNTL_SCNT5_POSN                     equ 0005h
DMA2SCNTL_SCNT5_POSITION                 equ 0005h
DMA2SCNTL_SCNT5_SIZE                     equ 0001h
DMA2SCNTL_SCNT5_LENGTH                   equ 0001h
DMA2SCNTL_SCNT5_MASK                     equ 0020h
DMA2SCNTL_SCNT6_POSN                     equ 0006h
DMA2SCNTL_SCNT6_POSITION                 equ 0006h
DMA2SCNTL_SCNT6_SIZE                     equ 0001h
DMA2SCNTL_SCNT6_LENGTH                   equ 0001h
DMA2SCNTL_SCNT6_MASK                     equ 0040h
DMA2SCNTL_SCNT7_POSN                     equ 0007h
DMA2SCNTL_SCNT7_POSITION                 equ 0007h
DMA2SCNTL_SCNT7_SIZE                     equ 0001h
DMA2SCNTL_SCNT7_LENGTH                   equ 0001h
DMA2SCNTL_SCNT7_MASK                     equ 0080h
DMA2SCNTL_DMA2SCNT_POSN                  equ 0000h
DMA2SCNTL_DMA2SCNT_POSITION              equ 0000h
DMA2SCNTL_DMA2SCNT_SIZE                  equ 0008h
DMA2SCNTL_DMA2SCNT_LENGTH                equ 0008h
DMA2SCNTL_DMA2SCNT_MASK                  equ 00FFh
DMA2SCNTL_DMA2SCNT0_POSN                 equ 0000h
DMA2SCNTL_DMA2SCNT0_POSITION             equ 0000h
DMA2SCNTL_DMA2SCNT0_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT0_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT0_MASK                 equ 0001h
DMA2SCNTL_DMA2SCNT1_POSN                 equ 0001h
DMA2SCNTL_DMA2SCNT1_POSITION             equ 0001h
DMA2SCNTL_DMA2SCNT1_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT1_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT1_MASK                 equ 0002h
DMA2SCNTL_DMA2SCNT2_POSN                 equ 0002h
DMA2SCNTL_DMA2SCNT2_POSITION             equ 0002h
DMA2SCNTL_DMA2SCNT2_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT2_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT2_MASK                 equ 0004h
DMA2SCNTL_DMA2SCNT3_POSN                 equ 0003h
DMA2SCNTL_DMA2SCNT3_POSITION             equ 0003h
DMA2SCNTL_DMA2SCNT3_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT3_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT3_MASK                 equ 0008h
DMA2SCNTL_DMA2SCNT4_POSN                 equ 0004h
DMA2SCNTL_DMA2SCNT4_POSITION             equ 0004h
DMA2SCNTL_DMA2SCNT4_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT4_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT4_MASK                 equ 0010h
DMA2SCNTL_DMA2SCNT5_POSN                 equ 0005h
DMA2SCNTL_DMA2SCNT5_POSITION             equ 0005h
DMA2SCNTL_DMA2SCNT5_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT5_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT5_MASK                 equ 0020h
DMA2SCNTL_DMA2SCNT6_POSN                 equ 0006h
DMA2SCNTL_DMA2SCNT6_POSITION             equ 0006h
DMA2SCNTL_DMA2SCNT6_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT6_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT6_MASK                 equ 0040h
DMA2SCNTL_DMA2SCNT7_POSN                 equ 0007h
DMA2SCNTL_DMA2SCNT7_POSITION             equ 0007h
DMA2SCNTL_DMA2SCNT7_SIZE                 equ 0001h
DMA2SCNTL_DMA2SCNT7_LENGTH               equ 0001h
DMA2SCNTL_DMA2SCNT7_MASK                 equ 0080h

// Register: DMA2SCNTH
#define DMA2SCNTH DMA2SCNTH
DMA2SCNTH                                equ 03BD3h
// bitfield definitions
DMA2SCNTH_SCNT_POSN                      equ 0000h
DMA2SCNTH_SCNT_POSITION                  equ 0000h
DMA2SCNTH_SCNT_SIZE                      equ 0004h
DMA2SCNTH_SCNT_LENGTH                    equ 0004h
DMA2SCNTH_SCNT_MASK                      equ 000Fh
DMA2SCNTH_SCNT8_POSN                     equ 0000h
DMA2SCNTH_SCNT8_POSITION                 equ 0000h
DMA2SCNTH_SCNT8_SIZE                     equ 0001h
DMA2SCNTH_SCNT8_LENGTH                   equ 0001h
DMA2SCNTH_SCNT8_MASK                     equ 0001h
DMA2SCNTH_SCNT9_POSN                     equ 0001h
DMA2SCNTH_SCNT9_POSITION                 equ 0001h
DMA2SCNTH_SCNT9_SIZE                     equ 0001h
DMA2SCNTH_SCNT9_LENGTH                   equ 0001h
DMA2SCNTH_SCNT9_MASK                     equ 0002h
DMA2SCNTH_SCNT10_POSN                    equ 0002h
DMA2SCNTH_SCNT10_POSITION                equ 0002h
DMA2SCNTH_SCNT10_SIZE                    equ 0001h
DMA2SCNTH_SCNT10_LENGTH                  equ 0001h
DMA2SCNTH_SCNT10_MASK                    equ 0004h
DMA2SCNTH_SCNT11_POSN                    equ 0003h
DMA2SCNTH_SCNT11_POSITION                equ 0003h
DMA2SCNTH_SCNT11_SIZE                    equ 0001h
DMA2SCNTH_SCNT11_LENGTH                  equ 0001h
DMA2SCNTH_SCNT11_MASK                    equ 0008h
DMA2SCNTH_DMA2SCNT_POSN                  equ 0000h
DMA2SCNTH_DMA2SCNT_POSITION              equ 0000h
DMA2SCNTH_DMA2SCNT_SIZE                  equ 0004h
DMA2SCNTH_DMA2SCNT_LENGTH                equ 0004h
DMA2SCNTH_DMA2SCNT_MASK                  equ 000Fh
DMA2SCNTH_DMA2SCNT8_POSN                 equ 0000h
DMA2SCNTH_DMA2SCNT8_POSITION             equ 0000h
DMA2SCNTH_DMA2SCNT8_SIZE                 equ 0001h
DMA2SCNTH_DMA2SCNT8_LENGTH               equ 0001h
DMA2SCNTH_DMA2SCNT8_MASK                 equ 0001h
DMA2SCNTH_DMA2SCNT9_POSN                 equ 0001h
DMA2SCNTH_DMA2SCNT9_POSITION             equ 0001h
DMA2SCNTH_DMA2SCNT9_SIZE                 equ 0001h
DMA2SCNTH_DMA2SCNT9_LENGTH               equ 0001h
DMA2SCNTH_DMA2SCNT9_MASK                 equ 0002h
DMA2SCNTH_DMA2SCNT10_POSN                equ 0002h
DMA2SCNTH_DMA2SCNT10_POSITION            equ 0002h
DMA2SCNTH_DMA2SCNT10_SIZE                equ 0001h
DMA2SCNTH_DMA2SCNT10_LENGTH              equ 0001h
DMA2SCNTH_DMA2SCNT10_MASK                equ 0004h
DMA2SCNTH_DMA2SCNT11_POSN                equ 0003h
DMA2SCNTH_DMA2SCNT11_POSITION            equ 0003h
DMA2SCNTH_DMA2SCNT11_SIZE                equ 0001h
DMA2SCNTH_DMA2SCNT11_LENGTH              equ 0001h
DMA2SCNTH_DMA2SCNT11_MASK                equ 0008h

// Register: DMA2SPTR
#define DMA2SPTR DMA2SPTR
DMA2SPTR                                 equ 03BD4h

// Register: DMA2SPTRL
#define DMA2SPTRL DMA2SPTRL
DMA2SPTRL                                equ 03BD4h
// bitfield definitions
DMA2SPTRL_SPTR_POSN                      equ 0000h
DMA2SPTRL_SPTR_POSITION                  equ 0000h
DMA2SPTRL_SPTR_SIZE                      equ 0008h
DMA2SPTRL_SPTR_LENGTH                    equ 0008h
DMA2SPTRL_SPTR_MASK                      equ 00FFh
DMA2SPTRL_SPTR0_POSN                     equ 0000h
DMA2SPTRL_SPTR0_POSITION                 equ 0000h
DMA2SPTRL_SPTR0_SIZE                     equ 0001h
DMA2SPTRL_SPTR0_LENGTH                   equ 0001h
DMA2SPTRL_SPTR0_MASK                     equ 0001h
DMA2SPTRL_SPTR1_POSN                     equ 0001h
DMA2SPTRL_SPTR1_POSITION                 equ 0001h
DMA2SPTRL_SPTR1_SIZE                     equ 0001h
DMA2SPTRL_SPTR1_LENGTH                   equ 0001h
DMA2SPTRL_SPTR1_MASK                     equ 0002h
DMA2SPTRL_SPTR2_POSN                     equ 0002h
DMA2SPTRL_SPTR2_POSITION                 equ 0002h
DMA2SPTRL_SPTR2_SIZE                     equ 0001h
DMA2SPTRL_SPTR2_LENGTH                   equ 0001h
DMA2SPTRL_SPTR2_MASK                     equ 0004h
DMA2SPTRL_SPTR3_POSN                     equ 0003h
DMA2SPTRL_SPTR3_POSITION                 equ 0003h
DMA2SPTRL_SPTR3_SIZE                     equ 0001h
DMA2SPTRL_SPTR3_LENGTH                   equ 0001h
DMA2SPTRL_SPTR3_MASK                     equ 0008h
DMA2SPTRL_SPTR4_POSN                     equ 0004h
DMA2SPTRL_SPTR4_POSITION                 equ 0004h
DMA2SPTRL_SPTR4_SIZE                     equ 0001h
DMA2SPTRL_SPTR4_LENGTH                   equ 0001h
DMA2SPTRL_SPTR4_MASK                     equ 0010h
DMA2SPTRL_SPTR5_POSN                     equ 0005h
DMA2SPTRL_SPTR5_POSITION                 equ 0005h
DMA2SPTRL_SPTR5_SIZE                     equ 0001h
DMA2SPTRL_SPTR5_LENGTH                   equ 0001h
DMA2SPTRL_SPTR5_MASK                     equ 0020h
DMA2SPTRL_SPTR6_POSN                     equ 0006h
DMA2SPTRL_SPTR6_POSITION                 equ 0006h
DMA2SPTRL_SPTR6_SIZE                     equ 0001h
DMA2SPTRL_SPTR6_LENGTH                   equ 0001h
DMA2SPTRL_SPTR6_MASK                     equ 0040h
DMA2SPTRL_SPTR7_POSN                     equ 0007h
DMA2SPTRL_SPTR7_POSITION                 equ 0007h
DMA2SPTRL_SPTR7_SIZE                     equ 0001h
DMA2SPTRL_SPTR7_LENGTH                   equ 0001h
DMA2SPTRL_SPTR7_MASK                     equ 0080h
DMA2SPTRL_DMA2SPTR_POSN                  equ 0000h
DMA2SPTRL_DMA2SPTR_POSITION              equ 0000h
DMA2SPTRL_DMA2SPTR_SIZE                  equ 0008h
DMA2SPTRL_DMA2SPTR_LENGTH                equ 0008h
DMA2SPTRL_DMA2SPTR_MASK                  equ 00FFh
DMA2SPTRL_DMA2SPTR0_POSN                 equ 0000h
DMA2SPTRL_DMA2SPTR0_POSITION             equ 0000h
DMA2SPTRL_DMA2SPTR0_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR0_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR0_MASK                 equ 0001h
DMA2SPTRL_DMA2SPTR1_POSN                 equ 0001h
DMA2SPTRL_DMA2SPTR1_POSITION             equ 0001h
DMA2SPTRL_DMA2SPTR1_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR1_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR1_MASK                 equ 0002h
DMA2SPTRL_DMA2SPTR2_POSN                 equ 0002h
DMA2SPTRL_DMA2SPTR2_POSITION             equ 0002h
DMA2SPTRL_DMA2SPTR2_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR2_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR2_MASK                 equ 0004h
DMA2SPTRL_DMA2SPTR3_POSN                 equ 0003h
DMA2SPTRL_DMA2SPTR3_POSITION             equ 0003h
DMA2SPTRL_DMA2SPTR3_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR3_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR3_MASK                 equ 0008h
DMA2SPTRL_DMA2SPTR4_POSN                 equ 0004h
DMA2SPTRL_DMA2SPTR4_POSITION             equ 0004h
DMA2SPTRL_DMA2SPTR4_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR4_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR4_MASK                 equ 0010h
DMA2SPTRL_DMA2SPTR5_POSN                 equ 0005h
DMA2SPTRL_DMA2SPTR5_POSITION             equ 0005h
DMA2SPTRL_DMA2SPTR5_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR5_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR5_MASK                 equ 0020h
DMA2SPTRL_DMA2SPTR6_POSN                 equ 0006h
DMA2SPTRL_DMA2SPTR6_POSITION             equ 0006h
DMA2SPTRL_DMA2SPTR6_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR6_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR6_MASK                 equ 0040h
DMA2SPTRL_DMA2SPTR7_POSN                 equ 0007h
DMA2SPTRL_DMA2SPTR7_POSITION             equ 0007h
DMA2SPTRL_DMA2SPTR7_SIZE                 equ 0001h
DMA2SPTRL_DMA2SPTR7_LENGTH               equ 0001h
DMA2SPTRL_DMA2SPTR7_MASK                 equ 0080h

