GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.inc
// Register: ADFLTRL
#define ADFLTRL ADFLTRL
ADFLTRL                                  equ 03EE6h
// bitfield definitions
ADFLTRL_FLTR_POSN                        equ 0000h
ADFLTRL_FLTR_POSITION                    equ 0000h
ADFLTRL_FLTR_SIZE                        equ 0008h
ADFLTRL_FLTR_LENGTH                      equ 0008h
ADFLTRL_FLTR_MASK                        equ 00FFh
ADFLTRL_ADFLTR0_POSN                     equ 0000h
ADFLTRL_ADFLTR0_POSITION                 equ 0000h
ADFLTRL_ADFLTR0_SIZE                     equ 0001h
ADFLTRL_ADFLTR0_LENGTH                   equ 0001h
ADFLTRL_ADFLTR0_MASK                     equ 0001h
ADFLTRL_ADFLTR1_POSN                     equ 0001h
ADFLTRL_ADFLTR1_POSITION                 equ 0001h
ADFLTRL_ADFLTR1_SIZE                     equ 0001h
ADFLTRL_ADFLTR1_LENGTH                   equ 0001h
ADFLTRL_ADFLTR1_MASK                     equ 0002h
ADFLTRL_ADFLTR2_POSN                     equ 0002h
ADFLTRL_ADFLTR2_POSITION                 equ 0002h
ADFLTRL_ADFLTR2_SIZE                     equ 0001h
ADFLTRL_ADFLTR2_LENGTH                   equ 0001h
ADFLTRL_ADFLTR2_MASK                     equ 0004h
ADFLTRL_ADFLTR3_POSN                     equ 0003h
ADFLTRL_ADFLTR3_POSITION                 equ 0003h
ADFLTRL_ADFLTR3_SIZE                     equ 0001h
ADFLTRL_ADFLTR3_LENGTH                   equ 0001h
ADFLTRL_ADFLTR3_MASK                     equ 0008h
ADFLTRL_ADFLTR4_POSN                     equ 0004h
ADFLTRL_ADFLTR4_POSITION                 equ 0004h
ADFLTRL_ADFLTR4_SIZE                     equ 0001h
ADFLTRL_ADFLTR4_LENGTH                   equ 0001h
ADFLTRL_ADFLTR4_MASK                     equ 0010h
ADFLTRL_ADFLTR5_POSN                     equ 0005h
ADFLTRL_ADFLTR5_POSITION                 equ 0005h
ADFLTRL_ADFLTR5_SIZE                     equ 0001h
ADFLTRL_ADFLTR5_LENGTH                   equ 0001h
ADFLTRL_ADFLTR5_MASK                     equ 0020h
ADFLTRL_ADFLTR6_POSN                     equ 0006h
ADFLTRL_ADFLTR6_POSITION                 equ 0006h
ADFLTRL_ADFLTR6_SIZE                     equ 0001h
ADFLTRL_ADFLTR6_LENGTH                   equ 0001h
ADFLTRL_ADFLTR6_MASK                     equ 0040h
ADFLTRL_ADFLTR7_POSN                     equ 0007h
ADFLTRL_ADFLTR7_POSITION                 equ 0007h
ADFLTRL_ADFLTR7_SIZE                     equ 0001h
ADFLTRL_ADFLTR7_LENGTH                   equ 0001h
ADFLTRL_ADFLTR7_MASK                     equ 0080h
ADFLTRL_ADFLTR_POSN                      equ 0000h
ADFLTRL_ADFLTR_POSITION                  equ 0000h
ADFLTRL_ADFLTR_SIZE                      equ 0008h
ADFLTRL_ADFLTR_LENGTH                    equ 0008h
ADFLTRL_ADFLTR_MASK                      equ 00FFh
ADFLTRL_FLTR0_POSN                       equ 0000h
ADFLTRL_FLTR0_POSITION                   equ 0000h
ADFLTRL_FLTR0_SIZE                       equ 0001h
ADFLTRL_FLTR0_LENGTH                     equ 0001h
ADFLTRL_FLTR0_MASK                       equ 0001h
ADFLTRL_FLTR1_POSN                       equ 0001h
ADFLTRL_FLTR1_POSITION                   equ 0001h
ADFLTRL_FLTR1_SIZE                       equ 0001h
ADFLTRL_FLTR1_LENGTH                     equ 0001h
ADFLTRL_FLTR1_MASK                       equ 0002h
ADFLTRL_FLTR2_POSN                       equ 0002h
ADFLTRL_FLTR2_POSITION                   equ 0002h
ADFLTRL_FLTR2_SIZE                       equ 0001h
ADFLTRL_FLTR2_LENGTH                     equ 0001h
ADFLTRL_FLTR2_MASK                       equ 0004h
ADFLTRL_FLTR3_POSN                       equ 0003h
ADFLTRL_FLTR3_POSITION                   equ 0003h
ADFLTRL_FLTR3_SIZE                       equ 0001h
ADFLTRL_FLTR3_LENGTH                     equ 0001h
ADFLTRL_FLTR3_MASK                       equ 0008h
ADFLTRL_FLTR4_POSN                       equ 0004h
ADFLTRL_FLTR4_POSITION                   equ 0004h
ADFLTRL_FLTR4_SIZE                       equ 0001h
ADFLTRL_FLTR4_LENGTH                     equ 0001h
ADFLTRL_FLTR4_MASK                       equ 0010h
ADFLTRL_FLTR5_POSN                       equ 0005h
ADFLTRL_FLTR5_POSITION                   equ 0005h
ADFLTRL_FLTR5_SIZE                       equ 0001h
ADFLTRL_FLTR5_LENGTH                     equ 0001h
ADFLTRL_FLTR5_MASK                       equ 0020h
ADFLTRL_FLTR6_POSN                       equ 0006h
ADFLTRL_FLTR6_POSITION                   equ 0006h
ADFLTRL_FLTR6_SIZE                       equ 0001h
ADFLTRL_FLTR6_LENGTH                     equ 0001h
ADFLTRL_FLTR6_MASK                       equ 0040h
ADFLTRL_FLTR7_POSN                       equ 0007h
ADFLTRL_FLTR7_POSITION                   equ 0007h
ADFLTRL_FLTR7_SIZE                       equ 0001h
ADFLTRL_FLTR7_LENGTH                     equ 0001h
ADFLTRL_FLTR7_MASK                       equ 0080h

// Register: ADFLTRH
#define ADFLTRH ADFLTRH
ADFLTRH                                  equ 03EE7h
// bitfield definitions
ADFLTRH_FLTR_POSN                        equ 0000h
ADFLTRH_FLTR_POSITION                    equ 0000h
ADFLTRH_FLTR_SIZE                        equ 0008h
ADFLTRH_FLTR_LENGTH                      equ 0008h
ADFLTRH_FLTR_MASK                        equ 00FFh
ADFLTRH_ADFLTR8_POSN                     equ 0000h
ADFLTRH_ADFLTR8_POSITION                 equ 0000h
ADFLTRH_ADFLTR8_SIZE                     equ 0001h
ADFLTRH_ADFLTR8_LENGTH                   equ 0001h
ADFLTRH_ADFLTR8_MASK                     equ 0001h
ADFLTRH_ADFLTR9_POSN                     equ 0001h
ADFLTRH_ADFLTR9_POSITION                 equ 0001h
ADFLTRH_ADFLTR9_SIZE                     equ 0001h
ADFLTRH_ADFLTR9_LENGTH                   equ 0001h
ADFLTRH_ADFLTR9_MASK                     equ 0002h
ADFLTRH_ADFLTR10_POSN                    equ 0002h
ADFLTRH_ADFLTR10_POSITION                equ 0002h
ADFLTRH_ADFLTR10_SIZE                    equ 0001h
ADFLTRH_ADFLTR10_LENGTH                  equ 0001h
ADFLTRH_ADFLTR10_MASK                    equ 0004h
ADFLTRH_ADFLTR11_POSN                    equ 0003h
ADFLTRH_ADFLTR11_POSITION                equ 0003h
ADFLTRH_ADFLTR11_SIZE                    equ 0001h
ADFLTRH_ADFLTR11_LENGTH                  equ 0001h
ADFLTRH_ADFLTR11_MASK                    equ 0008h
ADFLTRH_ADFLTR12_POSN                    equ 0004h
ADFLTRH_ADFLTR12_POSITION                equ 0004h
ADFLTRH_ADFLTR12_SIZE                    equ 0001h
ADFLTRH_ADFLTR12_LENGTH                  equ 0001h
ADFLTRH_ADFLTR12_MASK                    equ 0010h
ADFLTRH_ADFLTR13_POSN                    equ 0005h
ADFLTRH_ADFLTR13_POSITION                equ 0005h
ADFLTRH_ADFLTR13_SIZE                    equ 0001h
ADFLTRH_ADFLTR13_LENGTH                  equ 0001h
ADFLTRH_ADFLTR13_MASK                    equ 0020h
ADFLTRH_ADFLTR14_POSN                    equ 0006h
ADFLTRH_ADFLTR14_POSITION                equ 0006h
ADFLTRH_ADFLTR14_SIZE                    equ 0001h
ADFLTRH_ADFLTR14_LENGTH                  equ 0001h
ADFLTRH_ADFLTR14_MASK                    equ 0040h
ADFLTRH_ADFLTR15_POSN                    equ 0007h
ADFLTRH_ADFLTR15_POSITION                equ 0007h
ADFLTRH_ADFLTR15_SIZE                    equ 0001h
ADFLTRH_ADFLTR15_LENGTH                  equ 0001h
ADFLTRH_ADFLTR15_MASK                    equ 0080h
ADFLTRH_ADFLTR_POSN                      equ 0000h
ADFLTRH_ADFLTR_POSITION                  equ 0000h
ADFLTRH_ADFLTR_SIZE                      equ 0008h
ADFLTRH_ADFLTR_LENGTH                    equ 0008h
ADFLTRH_ADFLTR_MASK                      equ 00FFh
ADFLTRH_FLTR8_POSN                       equ 0000h
ADFLTRH_FLTR8_POSITION                   equ 0000h
ADFLTRH_FLTR8_SIZE                       equ 0001h
ADFLTRH_FLTR8_LENGTH                     equ 0001h
ADFLTRH_FLTR8_MASK                       equ 0001h
ADFLTRH_FLTR9_POSN                       equ 0001h
ADFLTRH_FLTR9_POSITION                   equ 0001h
ADFLTRH_FLTR9_SIZE                       equ 0001h
ADFLTRH_FLTR9_LENGTH                     equ 0001h
ADFLTRH_FLTR9_MASK                       equ 0002h
ADFLTRH_FLTR10_POSN                      equ 0002h
ADFLTRH_FLTR10_POSITION                  equ 0002h
ADFLTRH_FLTR10_SIZE                      equ 0001h
ADFLTRH_FLTR10_LENGTH                    equ 0001h
ADFLTRH_FLTR10_MASK                      equ 0004h
ADFLTRH_FLTR11_POSN                      equ 0003h
ADFLTRH_FLTR11_POSITION                  equ 0003h
ADFLTRH_FLTR11_SIZE                      equ 0001h
ADFLTRH_FLTR11_LENGTH                    equ 0001h
ADFLTRH_FLTR11_MASK                      equ 0008h
ADFLTRH_FLTR12_POSN                      equ 0004h
ADFLTRH_FLTR12_POSITION                  equ 0004h
ADFLTRH_FLTR12_SIZE                      equ 0001h
ADFLTRH_FLTR12_LENGTH                    equ 0001h
ADFLTRH_FLTR12_MASK                      equ 0010h
ADFLTRH_FLTR13_POSN                      equ 0005h
ADFLTRH_FLTR13_POSITION                  equ 0005h
ADFLTRH_FLTR13_SIZE                      equ 0001h
ADFLTRH_FLTR13_LENGTH                    equ 0001h
ADFLTRH_FLTR13_MASK                      equ 0020h
ADFLTRH_FLTR14_POSN                      equ 0006h
ADFLTRH_FLTR14_POSITION                  equ 0006h
ADFLTRH_FLTR14_SIZE                      equ 0001h
ADFLTRH_FLTR14_LENGTH                    equ 0001h
ADFLTRH_FLTR14_MASK                      equ 0040h
ADFLTRH_FLTR15_POSN                      equ 0007h
ADFLTRH_FLTR15_POSITION                  equ 0007h
ADFLTRH_FLTR15_SIZE                      equ 0001h
ADFLTRH_FLTR15_LENGTH                    equ 0001h
ADFLTRH_FLTR15_MASK                      equ 0080h

// Register: ADACC
#define ADACC ADACC
ADACC                                    equ 03EE8h

