GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.inc
// Register: PWM5DC
#define PWM5DC PWM5DC
PWM5DC                                   equ 03F6Ch

// Register: PWM5DCL
#define PWM5DCL PWM5DCL
PWM5DCL                                  equ 03F6Ch
// bitfield definitions
PWM5DCL_DC_POSN                          equ 0006h
PWM5DCL_DC_POSITION                      equ 0006h
PWM5DCL_DC_SIZE                          equ 0002h
PWM5DCL_DC_LENGTH                        equ 0002h
PWM5DCL_DC_MASK                          equ 00C0h
PWM5DCL_DC0_POSN                         equ 0006h
PWM5DCL_DC0_POSITION                     equ 0006h
PWM5DCL_DC0_SIZE                         equ 0001h
PWM5DCL_DC0_LENGTH                       equ 0001h
PWM5DCL_DC0_MASK                         equ 0040h
PWM5DCL_DC1_POSN                         equ 0007h
PWM5DCL_DC1_POSITION                     equ 0007h
PWM5DCL_DC1_SIZE                         equ 0001h
PWM5DCL_DC1_LENGTH                       equ 0001h
PWM5DCL_DC1_MASK                         equ 0080h
PWM5DCL_PWM5DC0_POSN                     equ 0006h
PWM5DCL_PWM5DC0_POSITION                 equ 0006h
PWM5DCL_PWM5DC0_SIZE                     equ 0001h
PWM5DCL_PWM5DC0_LENGTH                   equ 0001h
PWM5DCL_PWM5DC0_MASK                     equ 0040h
PWM5DCL_PWM5DC1_POSN                     equ 0007h
PWM5DCL_PWM5DC1_POSITION                 equ 0007h
PWM5DCL_PWM5DC1_SIZE                     equ 0001h
PWM5DCL_PWM5DC1_LENGTH                   equ 0001h
PWM5DCL_PWM5DC1_MASK                     equ 0080h
PWM5DCL_PWMPW0_POSN                      equ 0006h
PWM5DCL_PWMPW0_POSITION                  equ 0006h
PWM5DCL_PWMPW0_SIZE                      equ 0001h
PWM5DCL_PWMPW0_LENGTH                    equ 0001h
PWM5DCL_PWMPW0_MASK                      equ 0040h
PWM5DCL_PWMPW1_POSN                      equ 0007h
PWM5DCL_PWMPW1_POSITION                  equ 0007h
PWM5DCL_PWMPW1_SIZE                      equ 0001h
PWM5DCL_PWMPW1_LENGTH                    equ 0001h
PWM5DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM5DCH
#define PWM5DCH PWM5DCH
PWM5DCH                                  equ 03F6Dh
// bitfield definitions
PWM5DCH_DC_POSN                          equ 0000h
PWM5DCH_DC_POSITION                      equ 0000h
PWM5DCH_DC_SIZE                          equ 0008h
PWM5DCH_DC_LENGTH                        equ 0008h
PWM5DCH_DC_MASK                          equ 00FFh
PWM5DCH_DC2_POSN                         equ 0000h
PWM5DCH_DC2_POSITION                     equ 0000h
PWM5DCH_DC2_SIZE                         equ 0001h
PWM5DCH_DC2_LENGTH                       equ 0001h
PWM5DCH_DC2_MASK                         equ 0001h
PWM5DCH_DC3_POSN                         equ 0001h
PWM5DCH_DC3_POSITION                     equ 0001h
PWM5DCH_DC3_SIZE                         equ 0001h
PWM5DCH_DC3_LENGTH                       equ 0001h
PWM5DCH_DC3_MASK                         equ 0002h
PWM5DCH_DC4_POSN                         equ 0002h
PWM5DCH_DC4_POSITION                     equ 0002h
PWM5DCH_DC4_SIZE                         equ 0001h
PWM5DCH_DC4_LENGTH                       equ 0001h
PWM5DCH_DC4_MASK                         equ 0004h
PWM5DCH_DC5_POSN                         equ 0003h
PWM5DCH_DC5_POSITION                     equ 0003h
PWM5DCH_DC5_SIZE                         equ 0001h
PWM5DCH_DC5_LENGTH                       equ 0001h
PWM5DCH_DC5_MASK                         equ 0008h
PWM5DCH_DC6_POSN                         equ 0004h
PWM5DCH_DC6_POSITION                     equ 0004h
PWM5DCH_DC6_SIZE                         equ 0001h
PWM5DCH_DC6_LENGTH                       equ 0001h
PWM5DCH_DC6_MASK                         equ 0010h
PWM5DCH_DC7_POSN                         equ 0005h
PWM5DCH_DC7_POSITION                     equ 0005h
PWM5DCH_DC7_SIZE                         equ 0001h
PWM5DCH_DC7_LENGTH                       equ 0001h
PWM5DCH_DC7_MASK                         equ 0020h
PWM5DCH_DC8_POSN                         equ 0006h
PWM5DCH_DC8_POSITION                     equ 0006h
PWM5DCH_DC8_SIZE                         equ 0001h
PWM5DCH_DC8_LENGTH                       equ 0001h
PWM5DCH_DC8_MASK                         equ 0040h
PWM5DCH_DC9_POSN                         equ 0007h
PWM5DCH_DC9_POSITION                     equ 0007h
PWM5DCH_DC9_SIZE                         equ 0001h
PWM5DCH_DC9_LENGTH                       equ 0001h
PWM5DCH_DC9_MASK                         equ 0080h
PWM5DCH_PWM5DC2_POSN                     equ 0000h
PWM5DCH_PWM5DC2_POSITION                 equ 0000h
PWM5DCH_PWM5DC2_SIZE                     equ 0001h
PWM5DCH_PWM5DC2_LENGTH                   equ 0001h
PWM5DCH_PWM5DC2_MASK                     equ 0001h
PWM5DCH_PWM5DC3_POSN                     equ 0001h
PWM5DCH_PWM5DC3_POSITION                 equ 0001h
PWM5DCH_PWM5DC3_SIZE                     equ 0001h
PWM5DCH_PWM5DC3_LENGTH                   equ 0001h
PWM5DCH_PWM5DC3_MASK                     equ 0002h
PWM5DCH_PWM5DC4_POSN                     equ 0002h
PWM5DCH_PWM5DC4_POSITION                 equ 0002h
PWM5DCH_PWM5DC4_SIZE                     equ 0001h
PWM5DCH_PWM5DC4_LENGTH                   equ 0001h
PWM5DCH_PWM5DC4_MASK                     equ 0004h
PWM5DCH_PWM5DC5_POSN                     equ 0003h
PWM5DCH_PWM5DC5_POSITION                 equ 0003h
PWM5DCH_PWM5DC5_SIZE                     equ 0001h
PWM5DCH_PWM5DC5_LENGTH                   equ 0001h
PWM5DCH_PWM5DC5_MASK                     equ 0008h
PWM5DCH_PWM5DC6_POSN                     equ 0004h
PWM5DCH_PWM5DC6_POSITION                 equ 0004h
PWM5DCH_PWM5DC6_SIZE                     equ 0001h
PWM5DCH_PWM5DC6_LENGTH                   equ 0001h
PWM5DCH_PWM5DC6_MASK                     equ 0010h
PWM5DCH_PWM5DC7_POSN                     equ 0005h
PWM5DCH_PWM5DC7_POSITION                 equ 0005h
PWM5DCH_PWM5DC7_SIZE                     equ 0001h
PWM5DCH_PWM5DC7_LENGTH                   equ 0001h
PWM5DCH_PWM5DC7_MASK                     equ 0020h
PWM5DCH_PWM5DC8_POSN                     equ 0006h
PWM5DCH_PWM5DC8_POSITION                 equ 0006h
PWM5DCH_PWM5DC8_SIZE                     equ 0001h
PWM5DCH_PWM5DC8_LENGTH                   equ 0001h
PWM5DCH_PWM5DC8_MASK                     equ 0040h
PWM5DCH_PWM5DC9_POSN                     equ 0007h
PWM5DCH_PWM5DC9_POSITION                 equ 0007h
PWM5DCH_PWM5DC9_SIZE                     equ 0001h
PWM5DCH_PWM5DC9_LENGTH                   equ 0001h
PWM5DCH_PWM5DC9_MASK                     equ 0080h
PWM5DCH_PWMPW2_POSN                      equ 0000h
PWM5DCH_PWMPW2_POSITION                  equ 0000h
PWM5DCH_PWMPW2_SIZE                      equ 0001h
PWM5DCH_PWMPW2_LENGTH                    equ 0001h
PWM5DCH_PWMPW2_MASK                      equ 0001h
PWM5DCH_PWMPW3_POSN                      equ 0001h
PWM5DCH_PWMPW3_POSITION                  equ 0001h
PWM5DCH_PWMPW3_SIZE                      equ 0001h
PWM5DCH_PWMPW3_LENGTH                    equ 0001h
PWM5DCH_PWMPW3_MASK                      equ 0002h
PWM5DCH_PWMPW4_POSN                      equ 0002h
PWM5DCH_PWMPW4_POSITION                  equ 0002h
PWM5DCH_PWMPW4_SIZE                      equ 0001h
PWM5DCH_PWMPW4_LENGTH                    equ 0001h
PWM5DCH_PWMPW4_MASK                      equ 0004h
PWM5DCH_PWMPW5_POSN                      equ 0003h
PWM5DCH_PWMPW5_POSITION                  equ 0003h
PWM5DCH_PWMPW5_SIZE                      equ 0001h
PWM5DCH_PWMPW5_LENGTH                    equ 0001h
PWM5DCH_PWMPW5_MASK                      equ 0008h
PWM5DCH_PWMPW6_POSN                      equ 0004h
PWM5DCH_PWMPW6_POSITION                  equ 0004h
PWM5DCH_PWMPW6_SIZE                      equ 0001h
PWM5DCH_PWMPW6_LENGTH                    equ 0001h
PWM5DCH_PWMPW6_MASK                      equ 0010h
PWM5DCH_PWMPW7_POSN                      equ 0005h
PWM5DCH_PWMPW7_POSITION                  equ 0005h
PWM5DCH_PWMPW7_SIZE                      equ 0001h
PWM5DCH_PWMPW7_LENGTH                    equ 0001h
PWM5DCH_PWMPW7_MASK                      equ 0020h
PWM5DCH_PWMPW8_POSN                      equ 0006h
PWM5DCH_PWMPW8_POSITION                  equ 0006h
PWM5DCH_PWMPW8_SIZE                      equ 0001h
PWM5DCH_PWMPW8_LENGTH                    equ 0001h
PWM5DCH_PWMPW8_MASK                      equ 0040h
PWM5DCH_PWMPW9_POSN                      equ 0007h
PWM5DCH_PWMPW9_POSITION                  equ 0007h
PWM5DCH_PWMPW9_SIZE                      equ 0001h
PWM5DCH_PWMPW9_LENGTH                    equ 0001h
PWM5DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM5CON
#define PWM5CON PWM5CON
PWM5CON                                  equ 03F6Eh
// bitfield definitions
PWM5CON_POL_POSN                         equ 0004h
PWM5CON_POL_POSITION                     equ 0004h
PWM5CON_POL_SIZE                         equ 0001h
PWM5CON_POL_LENGTH                       equ 0001h
PWM5CON_POL_MASK                         equ 0010h
PWM5CON_OUT_POSN                         equ 0005h
PWM5CON_OUT_POSITION                     equ 0005h
PWM5CON_OUT_SIZE                         equ 0001h
PWM5CON_OUT_LENGTH                       equ 0001h
PWM5CON_OUT_MASK                         equ 0020h
PWM5CON_EN_POSN                          equ 0007h
PWM5CON_EN_POSITION                      equ 0007h
PWM5CON_EN_SIZE                          equ 0001h
PWM5CON_EN_LENGTH                        equ 0001h
PWM5CON_EN_MASK                          equ 0080h
PWM5CON_PWM5POL_POSN                     equ 0004h
PWM5CON_PWM5POL_POSITION                 equ 0004h
PWM5CON_PWM5POL_SIZE                     equ 0001h
PWM5CON_PWM5POL_LENGTH                   equ 0001h
PWM5CON_PWM5POL_MASK                     equ 0010h
PWM5CON_PWM5OUT_POSN                     equ 0005h
PWM5CON_PWM5OUT_POSITION                 equ 0005h
PWM5CON_PWM5OUT_SIZE                     equ 0001h
PWM5CON_PWM5OUT_LENGTH                   equ 0001h
PWM5CON_PWM5OUT_MASK                     equ 0020h
PWM5CON_PWM5EN_POSN                      equ 0007h
PWM5CON_PWM5EN_POSITION                  equ 0007h
PWM5CON_PWM5EN_SIZE                      equ 0001h
PWM5CON_PWM5EN_LENGTH                    equ 0001h
PWM5CON_PWM5EN_MASK                      equ 0080h

// Register: CCPR4
#define CCPR4 CCPR4
CCPR4                                    equ 03F70h

// Register: CCPR4L
#define CCPR4L CCPR4L
CCPR4L                                   equ 03F70h
// bitfield definitions
CCPR4L_RL_POSN                           equ 0000h
CCPR4L_RL_POSITION                       equ 0000h
CCPR4L_RL_SIZE                           equ 0008h
CCPR4L_RL_LENGTH                         equ 0008h
CCPR4L_RL_MASK                           equ 00FFh

// Register: CCPR4H
#define CCPR4H CCPR4H
CCPR4H                                   equ 03F71h
// bitfield definitions
CCPR4H_RH_POSN                           equ 0000h
CCPR4H_RH_POSITION                       equ 0000h
CCPR4H_RH_SIZE                           equ 0008h
CCPR4H_RH_LENGTH                         equ 0008h
CCPR4H_RH_MASK                           equ 00FFh

// Register: CCP4CON
#define CCP4CON CCP4CON
CCP4CON                                  equ 03F72h
// bitfield definitions
CCP4CON_MODE_POSN                        equ 0000h
CCP4CON_MODE_POSITION                    equ 0000h
CCP4CON_MODE_SIZE                        equ 0004h
CCP4CON_MODE_LENGTH                      equ 0004h
CCP4CON_MODE_MASK                        equ 000Fh
CCP4CON_FMT_POSN                         equ 0004h
CCP4CON_FMT_POSITION                     equ 0004h
CCP4CON_FMT_SIZE                         equ 0001h
CCP4CON_FMT_LENGTH                       equ 0001h
CCP4CON_FMT_MASK                         equ 0010h
CCP4CON_OUT_POSN                         equ 0005h
CCP4CON_OUT_POSITION                     equ 0005h
CCP4CON_OUT_SIZE                         equ 0001h
CCP4CON_OUT_LENGTH                       equ 0001h
CCP4CON_OUT_MASK                         equ 0020h
CCP4CON_EN_POSN                          equ 0007h
CCP4CON_EN_POSITION                      equ 0007h
CCP4CON_EN_SIZE                          equ 0001h
CCP4CON_EN_LENGTH                        equ 0001h
CCP4CON_EN_MASK                          equ 0080h
CCP4CON_MODE0_POSN                       equ 0000h
CCP4CON_MODE0_POSITION                   equ 0000h
CCP4CON_MODE0_SIZE                       equ 0001h
CCP4CON_MODE0_LENGTH                     equ 0001h
CCP4CON_MODE0_MASK                       equ 0001h
CCP4CON_MODE1_POSN                       equ 0001h
CCP4CON_MODE1_POSITION                   equ 0001h
CCP4CON_MODE1_SIZE                       equ 0001h
CCP4CON_MODE1_LENGTH                     equ 0001h
CCP4CON_MODE1_MASK                       equ 0002h
CCP4CON_MODE2_POSN                       equ 0002h
CCP4CON_MODE2_POSITION                   equ 0002h
CCP4CON_MODE2_SIZE                       equ 0001h
CCP4CON_MODE2_LENGTH                     equ 0001h
CCP4CON_MODE2_MASK                       equ 0004h
CCP4CON_MODE3_POSN                       equ 0003h
CCP4CON_MODE3_POSITION                   equ 0003h
CCP4CON_MODE3_SIZE                       equ 0001h
CCP4CON_MODE3_LENGTH                     equ 0001h
CCP4CON_MODE3_MASK                       equ 0008h
CCP4CON_CCP4MODE_POSN                    equ 0000h
CCP4CON_CCP4MODE_POSITION                equ 0000h
CCP4CON_CCP4MODE_SIZE                    equ 0004h
CCP4CON_CCP4MODE_LENGTH                  equ 0004h
CCP4CON_CCP4MODE_MASK                    equ 000Fh
CCP4CON_CCP4FMT_POSN                     equ 0004h
CCP4CON_CCP4FMT_POSITION                 equ 0004h
CCP4CON_CCP4FMT_SIZE                     equ 0001h
CCP4CON_CCP4FMT_LENGTH                   equ 0001h
CCP4CON_CCP4FMT_MASK                     equ 0010h
CCP4CON_CCP4OUT_POSN                     equ 0005h
CCP4CON_CCP4OUT_POSITION                 equ 0005h
CCP4CON_CCP4OUT_SIZE                     equ 0001h
CCP4CON_CCP4OUT_LENGTH                   equ 0001h
CCP4CON_CCP4OUT_MASK                     equ 0020h
CCP4CON_CCP4EN_POSN                      equ 0007h
CCP4CON_CCP4EN_POSITION                  equ 0007h
CCP4CON_CCP4EN_SIZE                      equ 0001h
CCP4CON_CCP4EN_LENGTH                    equ 0001h
CCP4CON_CCP4EN_MASK                      equ 0080h
CCP4CON_CCP4MODE0_POSN                   equ 0000h
CCP4CON_CCP4MODE0_POSITION               equ 0000h
CCP4CON_CCP4MODE0_SIZE                   equ 0001h
CCP4CON_CCP4MODE0_LENGTH                 equ 0001h
CCP4CON_CCP4MODE0_MASK                   equ 0001h
CCP4CON_CCP4MODE1_POSN                   equ 0001h
CCP4CON_CCP4MODE1_POSITION               equ 0001h
CCP4CON_CCP4MODE1_SIZE                   equ 0001h
CCP4CON_CCP4MODE1_LENGTH                 equ 0001h
CCP4CON_CCP4MODE1_MASK                   equ 0002h
CCP4CON_CCP4MODE2_POSN                   equ 0002h
CCP4CON_CCP4MODE2_POSITION               equ 0002h
CCP4CON_CCP4MODE2_SIZE                   equ 0001h
CCP4CON_CCP4MODE2_LENGTH                 equ 0001h
CCP4CON_CCP4MODE2_MASK                   equ 0004h
CCP4CON_CCP4MODE3_POSN                   equ 0003h
CCP4CON_CCP4MODE3_POSITION               equ 0003h
CCP4CON_CCP4MODE3_SIZE                   equ 0001h
CCP4CON_CCP4MODE3_LENGTH                 equ 0001h
CCP4CON_CCP4MODE3_MASK                   equ 0008h

