GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.inc
#define CPWUP                            BANKMASK(SMT1STAT), 6, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE0), 6, b
#define CRCIF                            BANKMASK(PIR0), 6, b
#define CRCIP                            BANKMASK(IPR0), 6, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSEL0                            BANKMASK(SMT1CLK), 0, b
#define CSEL1                            BANKMASK(SMT1CLK), 1, b
#define CSEL2                            BANKMASK(SMT1CLK), 2, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, b
#define CSWIF                            BANKMASK(PIR0), 3, b
#define CSWIP                            BANKMASK(IPR0), 3, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE4), 6, b
#define CWG1IF                           BANKMASK(PIR4), 6, b
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
#define CWG1IP                           BANKMASK(IPR4), 6, b
#define CWG1LD                           BANKMASK(CWG1CON0), 6, b
#define CWG1LSAC0                        BANKMASK(CWG1AS0), 2, b
#define CWG1LSAC1                        BANKMASK(CWG1AS0), 3, b
#define CWG1LSBD0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSBD1                        BANKMASK(CWG1AS0), 5, b
#define CWG1LSDB0                        BANKMASK(CWG1AS0), 4, b
#define CWG1LSDB1                        BANKMASK(CWG1AS0), 5, b
#define CWG1MD                           BANKMASK(PMD4), 5, b
#define CWG1MODE0                        BANKMASK(CWG1CON0), 0, b
#define CWG1MODE1                        BANKMASK(CWG1CON0), 1, b
#define CWG1MODE2                        BANKMASK(CWG1CON0), 2, b
#define CWG1OVRA                         BANKMASK(CWG1STR), 4, b
#define CWG1OVRB                         BANKMASK(CWG1STR), 5, b
#define CWG1OVRC                         BANKMASK(CWG1STR), 6, b
#define CWG1OVRD                         BANKMASK(CWG1STR), 7, b
#define CWG1POLA                         BANKMASK(CWG1CON1), 0, b
#define CWG1POLB                         BANKMASK(CWG1CON1), 1, b
#define CWG1POLC                         BANKMASK(CWG1CON1), 2, b
#define CWG1POLD                         BANKMASK(CWG1CON1), 3, b
#define CWG1STRA                         BANKMASK(CWG1STR), 0, b
#define CWG1STRB                         BANKMASK(CWG1STR), 1, b
#define CWG1STRC                         BANKMASK(CWG1STR), 2, b
#define CWG1STRD                         BANKMASK(CWG1STR), 3, b
#define CWG2CS                           BANKMASK(CWG2CLK), 0, b
#define CWG2DBF0                         BANKMASK(CWG2DBF), 0, b
#define CWG2DBF1                         BANKMASK(CWG2DBF), 1, b
#define CWG2DBF2                         BANKMASK(CWG2DBF), 2, b
#define CWG2DBF3                         BANKMASK(CWG2DBF), 3, b
#define CWG2DBF4                         BANKMASK(CWG2DBF), 4, b
#define CWG2DBF5                         BANKMASK(CWG2DBF), 5, b
#define CWG2DBR0                         BANKMASK(CWG2DBR), 0, b
#define CWG2DBR1                         BANKMASK(CWG2DBR), 1, b
#define CWG2DBR2                         BANKMASK(CWG2DBR), 2, b
#define CWG2DBR3                         BANKMASK(CWG2DBR), 3, b
#define CWG2DBR4                         BANKMASK(CWG2DBR), 4, b
#define CWG2DBR5                         BANKMASK(CWG2DBR), 5, b
#define CWG2EN                           BANKMASK(CWG2CON0), 7, b
#define CWG2IE                           BANKMASK(PIE7), 3, b
#define CWG2IF                           BANKMASK(PIR7), 3, b
#define CWG2IN                           BANKMASK(CWG2CON1), 5, b
#define CWG2IP                           BANKMASK(IPR7), 3, b
#define CWG2LD                           BANKMASK(CWG2CON0), 6, b
#define CWG2LSAC0                        BANKMASK(CWG2AS0), 2, b
#define CWG2LSAC1                        BANKMASK(CWG2AS0), 3, b
#define CWG2LSBD0                        BANKMASK(CWG2AS0), 4, b
#define CWG2LSBD1                        BANKMASK(CWG2AS0), 5, b
#define CWG2LSDB0                        BANKMASK(CWG2AS0), 4, b
#define CWG2LSDB1                        BANKMASK(CWG2AS0), 5, b
#define CWG2MD                           BANKMASK(PMD4), 6, b
#define CWG2MODE0                        BANKMASK(CWG2CON0), 0, b
#define CWG2MODE1                        BANKMASK(CWG2CON0), 1, b
#define CWG2MODE2                        BANKMASK(CWG2CON0), 2, b
#define CWG2OVRA                         BANKMASK(CWG2STR), 4, b
#define CWG2OVRB                         BANKMASK(CWG2STR), 5, b
#define CWG2OVRC                         BANKMASK(CWG2STR), 6, b
#define CWG2OVRD                         BANKMASK(CWG2STR), 7, b
#define CWG2POLA                         BANKMASK(CWG2CON1), 0, b
#define CWG2POLB                         BANKMASK(CWG2CON1), 1, b
#define CWG2POLC                         BANKMASK(CWG2CON1), 2, b
#define CWG2POLD                         BANKMASK(CWG2CON1), 3, b
#define CWG2STRA                         BANKMASK(CWG2STR), 0, b
#define CWG2STRB                         BANKMASK(CWG2STR), 1, b
#define CWG2STRC                         BANKMASK(CWG2STR), 2, b
#define CWG2STRD                         BANKMASK(CWG2STR), 3, b
#define CWG3CS                           BANKMASK(CWG3CLK), 0, b
#define CWG3DBF0                         BANKMASK(CWG3DBF), 0, b
#define CWG3DBF1                         BANKMASK(CWG3DBF), 1, b
#define CWG3DBF2                         BANKMASK(CWG3DBF), 2, b
#define CWG3DBF3                         BANKMASK(CWG3DBF), 3, b
#define CWG3DBF4                         BANKMASK(CWG3DBF), 4, b
#define CWG3DBF5                         BANKMASK(CWG3DBF), 5, b
#define CWG3DBR0                         BANKMASK(CWG3DBR), 0, b
#define CWG3DBR1                         BANKMASK(CWG3DBR), 1, b
#define CWG3DBR2                         BANKMASK(CWG3DBR), 2, b
#define CWG3DBR3                         BANKMASK(CWG3DBR), 3, b
#define CWG3DBR4                         BANKMASK(CWG3DBR), 4, b
#define CWG3DBR5                         BANKMASK(CWG3DBR), 5, b
#define CWG3EN                           BANKMASK(CWG3CON0), 7, b
#define CWG3IE                           BANKMASK(PIE9), 2, b
#define CWG3IF                           BANKMASK(PIR9), 2, b
#define CWG3IN                           BANKMASK(CWG3CON1), 5, b
#define CWG3IP                           BANKMASK(IPR9), 2, b
#define CWG3LD                           BANKMASK(CWG3CON0), 6, b
#define CWG3LSAC0                        BANKMASK(CWG3AS0), 2, b
#define CWG3LSAC1                        BANKMASK(CWG3AS0), 3, b
#define CWG3LSBD0                        BANKMASK(CWG3AS0), 4, b
#define CWG3LSBD1                        BANKMASK(CWG3AS0), 5, b
#define CWG3LSDB0                        BANKMASK(CWG3AS0), 4, b
#define CWG3LSDB1                        BANKMASK(CWG3AS0), 5, b
#define CWG3MD                           BANKMASK(PMD4), 7, b
#define CWG3MODE0                        BANKMASK(CWG3CON0), 0, b
#define CWG3MODE1                        BANKMASK(CWG3CON0), 1, b
#define CWG3MODE2                        BANKMASK(CWG3CON0), 2, b
#define CWG3OVRA                         BANKMASK(CWG3STR), 4, b
#define CWG3OVRB                         BANKMASK(CWG3STR), 5, b
#define CWG3OVRC                         BANKMASK(CWG3STR), 6, b
#define CWG3OVRD                         BANKMASK(CWG3STR), 7, b
#define CWG3POLA                         BANKMASK(CWG3CON1), 0, b
#define CWG3POLB                         BANKMASK(CWG3CON1), 1, b
#define CWG3POLC                         BANKMASK(CWG3CON1), 2, b
#define CWG3POLD                         BANKMASK(CWG3CON1), 3, b
#define CWG3STRA                         BANKMASK(CWG3STR), 0, b
#define CWG3STRB                         BANKMASK(CWG3STR), 1, b
#define CWG3STRC                         BANKMASK(CWG3STR), 2, b
#define CWG3STRD                         BANKMASK(CWG3STR), 3, b
#define DAC1EN                           BANKMASK(DAC1CON0), 7, b
#define DAC1NSS                          BANKMASK(DAC1CON0), 0, b
#define DAC1OE1                          BANKMASK(DAC1CON0), 5, b
#define DAC1OE2                          BANKMASK(DAC1CON0), 4, b
#define DAC1PSS0                         BANKMASK(DAC1CON0), 2, b
#define DAC1PSS1                         BANKMASK(DAC1CON0), 3, b
#define DAC1R0                           BANKMASK(DAC1CON1), 0, b
#define DAC1R1                           BANKMASK(DAC1CON1), 1, b
#define DAC1R2                           BANKMASK(DAC1CON1), 2, b
#define DAC1R3                           BANKMASK(DAC1CON1), 3, b
#define DAC1R4                           BANKMASK(DAC1CON1), 4, b
#define DACMD                            BANKMASK(PMD2), 6, b
#define DAT0                             BANKMASK(NVMDAT), 0, b
#define DAT1                             BANKMASK(NVMDAT), 1, b
#define DAT2                             BANKMASK(NVMDAT), 2, b
#define DAT3                             BANKMASK(NVMDAT), 3, b
#define DAT4                             BANKMASK(NVMDAT), 4, b
#define DAT5                             BANKMASK(NVMDAT), 5, b
#define DAT6                             BANKMASK(NVMDAT), 6, b
#define DAT7                             BANKMASK(NVMDAT), 7, b
#define DATA0                            BANKMASK(CRCDATL), 0, b
#define DATA1                            BANKMASK(CRCDATL), 1, b
#define DATA10                           BANKMASK(CRCDATH), 2, b
#define DATA11                           BANKMASK(CRCDATH), 3, b
#define DATA12                           BANKMASK(CRCDATH), 4, b
#define DATA13                           BANKMASK(CRCDATH), 5, b
#define DATA14                           BANKMASK(CRCDATH), 6, b
#define DATA15                           BANKMASK(CRCDATH), 7, b
#define DATA2                            BANKMASK(CRCDATL), 2, b
#define DATA3                            BANKMASK(CRCDATL), 3, b
#define DATA4                            BANKMASK(CRCDATL), 4, b
#define DATA5                            BANKMASK(CRCDATL), 5, b
#define DATA6                            BANKMASK(CRCDATL), 6, b
#define DATA7                            BANKMASK(CRCDATL), 7, b
#define DATA8                            BANKMASK(CRCDATH), 0, b
#define DATA9                            BANKMASK(CRCDATH), 1, b
#define DLEN0                            BANKMASK(CRCCON1), 4, b
#define DLEN1                            BANKMASK(CRCCON1), 5, b
#define DLEN2                            BANKMASK(CRCCON1), 6, b
#define DLEN3                            BANKMASK(CRCCON1), 7, b
#define DMA1AIE                          BANKMASK(PIE2), 3, b
#define DMA1AIF                          BANKMASK(PIR2), 3, b
#define DMA1AIP                          BANKMASK(IPR2), 3, b
#define DMA1AIRQ0                        BANKMASK(DMA1AIRQ), 0, b
#define DMA1AIRQ1                        BANKMASK(DMA1AIRQ), 1, b
#define DMA1AIRQ2                        BANKMASK(DMA1AIRQ), 2, b
#define DMA1AIRQ3                        BANKMASK(DMA1AIRQ), 3, b
#define DMA1AIRQ4                        BANKMASK(DMA1AIRQ), 4, b
#define DMA1AIRQ5                        BANKMASK(DMA1AIRQ), 5, b
#define DMA1AIRQ6                        BANKMASK(DMA1AIRQ), 6, b
#define DMA1AIRQEN                       BANKMASK(DMA1CON0), 2, b
#define DMA1BUF0                         BANKMASK(DMA1BUF), 0, b
#define DMA1BUF1                         BANKMASK(DMA1BUF), 1, b
#define DMA1BUF2                         BANKMASK(DMA1BUF), 2, b
#define DMA1BUF3                         BANKMASK(DMA1BUF), 3, b
#define DMA1BUF4                         BANKMASK(DMA1BUF), 4, b
#define DMA1BUF5                         BANKMASK(DMA1BUF), 5, b
#define DMA1BUF6                         BANKMASK(DMA1BUF), 6, b
#define DMA1BUF7                         BANKMASK(DMA1BUF), 7, b
#define DMA1DCNT0                        BANKMASK(DMA1DCNTL), 0, b
#define DMA1DCNT1                        BANKMASK(DMA1DCNTL), 1, b
#define DMA1DCNT10                       BANKMASK(DMA1DCNTH), 2, b
#define DMA1DCNT11                       BANKMASK(DMA1DCNTH), 3, b
#define DMA1DCNT2                        BANKMASK(DMA1DCNTL), 2, b
#define DMA1DCNT3                        BANKMASK(DMA1DCNTL), 3, b
#define DMA1DCNT4                        BANKMASK(DMA1DCNTL), 4, b
#define DMA1DCNT5                        BANKMASK(DMA1DCNTL), 5, b
#define DMA1DCNT6                        BANKMASK(DMA1DCNTL), 6, b
#define DMA1DCNT7                        BANKMASK(DMA1DCNTL), 7, b
#define DMA1DCNT8                        BANKMASK(DMA1DCNTH), 0, b
#define DMA1DCNT9                        BANKMASK(DMA1DCNTH), 1, b
#define DMA1DCNTIE                       BANKMASK(PIE2), 1, b
#define DMA1DCNTIF                       BANKMASK(PIR2), 1, b
#define DMA1DCNTIP                       BANKMASK(IPR2), 1, b
#define DMA1DGO                          BANKMASK(DMA1CON0), 5, b
#define DMA1DPTR0                        BANKMASK(DMA1DPTRL), 0, b
#define DMA1DPTR1                        BANKMASK(DMA1DPTRL), 1, b
#define DMA1DPTR10                       BANKMASK(DMA1DPTRH), 2, b
#define DMA1DPTR11                       BANKMASK(DMA1DPTRH), 3, b
#define DMA1DPTR12                       BANKMASK(DMA1DPTRH), 4, b
#define DMA1DPTR13                       BANKMASK(DMA1DPTRH), 5, b
#define DMA1DPTR14                       BANKMASK(DMA1DPTRH), 6, b
#define DMA1DPTR15                       BANKMASK(DMA1DPTRH), 7, b
#define DMA1DPTR2                        BANKMASK(DMA1DPTRL), 2, b
#define DMA1DPTR3                        BANKMASK(DMA1DPTRL), 3, b
#define DMA1DPTR4                        BANKMASK(DMA1DPTRL), 4, b
#define DMA1DPTR5                        BANKMASK(DMA1DPTRL), 5, b
#define DMA1DPTR6                        BANKMASK(DMA1DPTRL), 6, b
#define DMA1DPTR7                        BANKMASK(DMA1DPTRL), 7, b
#define DMA1DPTR8                        BANKMASK(DMA1DPTRH), 0, b
#define DMA1DPTR9                        BANKMASK(DMA1DPTRH), 1, b
#define DMA1DSA0                         BANKMASK(DMA1DSAL), 0, b
#define DMA1DSA1                         BANKMASK(DMA1DSAL), 1, b
#define DMA1DSA10                        BANKMASK(DMA1DSAH), 2, b
#define DMA1DSA11                        BANKMASK(DMA1DSAH), 3, b
#define DMA1DSA12                        BANKMASK(DMA1DSAH), 4, b
#define DMA1DSA13                        BANKMASK(DMA1DSAH), 5, b
#define DMA1DSA14                        BANKMASK(DMA1DSAH), 6, b
#define DMA1DSA15                        BANKMASK(DMA1DSAH), 7, b
#define DMA1DSA2                         BANKMASK(DMA1DSAL), 2, b
#define DMA1DSA3                         BANKMASK(DMA1DSAL), 3, b
#define DMA1DSA4                         BANKMASK(DMA1DSAL), 4, b
#define DMA1DSA5                         BANKMASK(DMA1DSAL), 5, b
#define DMA1DSA6                         BANKMASK(DMA1DSAL), 6, b
#define DMA1DSA7                         BANKMASK(DMA1DSAL), 7, b
#define DMA1DSA8                         BANKMASK(DMA1DSAH), 0, b
#define DMA1DSA9                         BANKMASK(DMA1DSAH), 1, b
#define DMA1DSZ0                         BANKMASK(DMA1DSZL), 0, b
#define DMA1DSZ1                         BANKMASK(DMA1DSZL), 1, b
#define DMA1DSZ10                        BANKMASK(DMA1DSZH), 2, b
#define DMA1DSZ11                        BANKMASK(DMA1DSZH), 3, b
#define DMA1DSZ2                         BANKMASK(DMA1DSZL), 2, b
#define DMA1DSZ3                         BANKMASK(DMA1DSZL), 3, b
#define DMA1DSZ4                         BANKMASK(DMA1DSZL), 4, b
#define DMA1DSZ5                         BANKMASK(DMA1DSZL), 5, b
#define DMA1DSZ6                         BANKMASK(DMA1DSZL), 6, b
#define DMA1DSZ7                         BANKMASK(DMA1DSZL), 7, b
#define DMA1DSZ8                         BANKMASK(DMA1DSZH), 0, b
#define DMA1DSZ9                         BANKMASK(DMA1DSZH), 1, b
#define DMA1EN                           BANKMASK(DMA1CON0), 7, b
#define DMA1MD                           BANKMASK(PMD7), 0, b
#define DMA1ORIE                         BANKMASK(PIE2), 2, b
#define DMA1ORIF                         BANKMASK(PIR2), 2, b
#define DMA1ORIP                         BANKMASK(IPR2), 2, b
#define DMA1PR0                          BANKMASK(DMA1PR), 0, b
#define DMA1PR1                          BANKMASK(DMA1PR), 1, b
#define DMA1PR2                          BANKMASK(DMA1PR), 2, b
#define DMA1SCNT0                        BANKMASK(DMA1SCNTL), 0, b
#define DMA1SCNT1                        BANKMASK(DMA1SCNTL), 1, b
#define DMA1SCNT10                       BANKMASK(DMA1SCNTH), 2, b
#define DMA1SCNT11                       BANKMASK(DMA1SCNTH), 3, b
#define DMA1SCNT2                        BANKMASK(DMA1SCNTL), 2, b
#define DMA1SCNT3                        BANKMASK(DMA1SCNTL), 3, b
#define DMA1SCNT4                        BANKMASK(DMA1SCNTL), 4, b
#define DMA1SCNT5                        BANKMASK(DMA1SCNTL), 5, b
#define DMA1SCNT6                        BANKMASK(DMA1SCNTL), 6, b
#define DMA1SCNT7                        BANKMASK(DMA1SCNTL), 7, b
#define DMA1SCNT8                        BANKMASK(DMA1SCNTH), 0, b
#define DMA1SCNT9                        BANKMASK(DMA1SCNTH), 1, b
#define DMA1SCNTIE                       BANKMASK(PIE2), 0, b
#define DMA1SCNTIF                       BANKMASK(PIR2), 0, b
#define DMA1SCNTIP                       BANKMASK(IPR2), 0, b
#define DMA1SIRQ0                        BANKMASK(DMA1SIRQ), 0, b
#define DMA1SIRQ1                        BANKMASK(DMA1SIRQ), 1, b
#define DMA1SIRQ2                        BANKMASK(DMA1SIRQ), 2, b
#define DMA1SIRQ3                        BANKMASK(DMA1SIRQ), 3, b
#define DMA1SIRQ4                        BANKMASK(DMA1SIRQ), 4, b
#define DMA1SIRQ5                        BANKMASK(DMA1SIRQ), 5, b
#define DMA1SIRQ6                        BANKMASK(DMA1SIRQ), 6, b
#define DMA1SIRQEN                       BANKMASK(DMA1CON0), 6, b
#define DMA1SPTR0                        BANKMASK(DMA1SPTRL), 0, b
#define DMA1SPTR1                        BANKMASK(DMA1SPTRL), 1, b
#define DMA1SPTR10                       BANKMASK(DMA1SPTRH), 2, b
#define DMA1SPTR11                       BANKMASK(DMA1SPTRH), 3, b
#define DMA1SPTR12                       BANKMASK(DMA1SPTRH), 4, b
#define DMA1SPTR13                       BANKMASK(DMA1SPTRH), 5, b
#define DMA1SPTR14                       BANKMASK(DMA1SPTRH), 6, b
#define DMA1SPTR15                       BANKMASK(DMA1SPTRH), 7, b
#define DMA1SPTR16                       BANKMASK(DMA1SPTRU), 0, b
#define DMA1SPTR17                       BANKMASK(DMA1SPTRU), 1, b
#define DMA1SPTR18                       BANKMASK(DMA1SPTRU), 2, b
#define DMA1SPTR19                       BANKMASK(DMA1SPTRU), 3, b
#define DMA1SPTR2                        BANKMASK(DMA1SPTRL), 2, b
#define DMA1SPTR20                       BANKMASK(DMA1SPTRU), 4, b
#define DMA1SPTR21                       BANKMASK(DMA1SPTRU), 5, b
#define DMA1SPTR3                        BANKMASK(DMA1SPTRL), 3, b
#define DMA1SPTR4                        BANKMASK(DMA1SPTRL), 4, b
#define DMA1SPTR5                        BANKMASK(DMA1SPTRL), 5, b
#define DMA1SPTR6                        BANKMASK(DMA1SPTRL), 6, b
#define DMA1SPTR7                        BANKMASK(DMA1SPTRL), 7, b
#define DMA1SPTR8                        BANKMASK(DMA1SPTRH), 0, b
#define DMA1SPTR9                        BANKMASK(DMA1SPTRH), 1, b
#define DMA1SSA0                         BANKMASK(DMA1SSAL), 0, b
#define DMA1SSA1                         BANKMASK(DMA1SSAL), 1, b
#define DMA1SSA10                        BANKMASK(DMA1SSAH), 2, b
#define DMA1SSA11                        BANKMASK(DMA1SSAH), 3, b
#define DMA1SSA12                        BANKMASK(DMA1SSAH), 4, b
#define DMA1SSA13                        BANKMASK(DMA1SSAH), 5, b
#define DMA1SSA14                        BANKMASK(DMA1SSAH), 6, b
#define DMA1SSA15                        BANKMASK(DMA1SSAH), 7, b
#define DMA1SSA16                        BANKMASK(DMA1SSAU), 0, b
#define DMA1SSA17                        BANKMASK(DMA1SSAU), 1, b
#define DMA1SSA18                        BANKMASK(DMA1SSAU), 2, b
#define DMA1SSA19                        BANKMASK(DMA1SSAU), 3, b
#define DMA1SSA2                         BANKMASK(DMA1SSAL), 2, b
#define DMA1SSA20                        BANKMASK(DMA1SSAU), 4, b
#define DMA1SSA21                        BANKMASK(DMA1SSAU), 5, b
#define DMA1SSA3                         BANKMASK(DMA1SSAL), 3, b
#define DMA1SSA4                         BANKMASK(DMA1SSAL), 4, b
#define DMA1SSA5                         BANKMASK(DMA1SSAL), 5, b
#define DMA1SSA6                         BANKMASK(DMA1SSAL), 6, b
#define DMA1SSA7                         BANKMASK(DMA1SSAL), 7, b
#define DMA1SSA8                         BANKMASK(DMA1SSAH), 0, b
#define DMA1SSA9                         BANKMASK(DMA1SSAH), 1, b
#define DMA1SSZ0                         BANKMASK(DMA1SSZL), 0, b
#define DMA1SSZ1                         BANKMASK(DMA1SSZL), 1, b
#define DMA1SSZ10                        BANKMASK(DMA1SSZH), 2, b
#define DMA1SSZ11                        BANKMASK(DMA1SSZH), 3, b
#define DMA1SSZ2                         BANKMASK(DMA1SSZL), 2, b
#define DMA1SSZ3                         BANKMASK(DMA1SSZL), 3, b
#define DMA1SSZ4                         BANKMASK(DMA1SSZL), 4, b
#define DMA1SSZ5                         BANKMASK(DMA1SSZL), 5, b
#define DMA1SSZ6                         BANKMASK(DMA1SSZL), 6, b
#define DMA1SSZ7                         BANKMASK(DMA1SSZL), 7, b
#define DMA1SSZ8                         BANKMASK(DMA1SSZH), 0, b
#define DMA1SSZ9                         BANKMASK(DMA1SSZH), 1, b
#define DMA1XIP                          BANKMASK(DMA1CON0), 0, b
#define DMA2AIE                          BANKMASK(PIE5), 5, b
#define DMA2AIF                          BANKMASK(PIR5), 5, b
#define DMA2AIP                          BANKMASK(IPR5), 5, b
#define DMA2AIRQ0                        BANKMASK(DMA2AIRQ), 0, b
#define DMA2AIRQ1                        BANKMASK(DMA2AIRQ), 1, b
#define DMA2AIRQ2                        BANKMASK(DMA2AIRQ), 2, b
#define DMA2AIRQ3                        BANKMASK(DMA2AIRQ), 3, b
#define DMA2AIRQ4                        BANKMASK(DMA2AIRQ), 4, b
#define DMA2AIRQ5                        BANKMASK(DMA2AIRQ), 5, b
#define DMA2AIRQ6                        BANKMASK(DMA2AIRQ), 6, b
#define DMA2AIRQEN                       BANKMASK(DMA2CON0), 2, b
#define DMA2BUF0                         BANKMASK(DMA2BUF), 0, b
#define DMA2BUF1                         BANKMASK(DMA2BUF), 1, b
#define DMA2BUF2                         BANKMASK(DMA2BUF), 2, b
#define DMA2BUF3                         BANKMASK(DMA2BUF), 3, b
#define DMA2BUF4                         BANKMASK(DMA2BUF), 4, b
#define DMA2BUF5                         BANKMASK(DMA2BUF), 5, b
#define DMA2BUF6                         BANKMASK(DMA2BUF), 6, b
#define DMA2BUF7                         BANKMASK(DMA2BUF), 7, b
