GopalSaraf/Practicals/PSDL/include/proc/pic18f46k42.inc
#define ROI                              BANKMASK(CPUDOZE), 5, b
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSC2IE                           BANKMASK(I2C2PIE), 1, b
#define RSC2IF                           BANKMASK(I2C2PIR), 1, b
#define RST                              BANKMASK(SMT1STAT), 5, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RXB0                             BANKMASK(SPI1RXB), 0, b
#define RXB1                             BANKMASK(SPI1RXB), 1, b
#define RXB2                             BANKMASK(SPI1RXB), 2, b
#define RXB3                             BANKMASK(SPI1RXB), 3, b
#define RXB4                             BANKMASK(SPI1RXB), 4, b
#define RXB5                             BANKMASK(SPI1RXB), 5, b
#define RXB6                             BANKMASK(SPI1RXB), 6, b
#define RXB7                             BANKMASK(SPI1RXB), 7, b
#define RXOIE                            BANKMASK(SPI1INTE), 2, b
#define RXOIF                            BANKMASK(SPI1INTF), 2, b
#define RXR                              BANKMASK(SPI1CON2), 0, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SC2IE                            BANKMASK(I2C2PIE), 0, b
#define SC2IF                            BANKMASK(I2C2PIR), 0, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE0), 5, b
#define SCANIF                           BANKMASK(PIR0), 5, b
#define SCANIP                           BANKMASK(IPR0), 5, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANPR0                          BANKMASK(SCANPR), 0, b
#define SCANPR1                          BANKMASK(SCANPR), 1, b
#define SCANPR2                          BANKMASK(SCANPR), 2, b
#define SDIP                             BANKMASK(SPI1CON1), 1, b
#define SDOP                             BANKMASK(SPI1CON1), 0, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SGO                              BANKMASK(SCANCON0), 5, b
#define SHADLO                           BANKMASK(SHADCON), 0, b
#define SHFT0                            BANKMASK(CRCSHIFTL), 0, b
#define SHFT1                            BANKMASK(CRCSHIFTL), 1, b
#define SHFT10                           BANKMASK(CRCSHIFTH), 2, b
#define SHFT11                           BANKMASK(CRCSHIFTH), 3, b
#define SHFT12                           BANKMASK(CRCSHIFTH), 4, b
#define SHFT13                           BANKMASK(CRCSHIFTH), 5, b
#define SHFT14                           BANKMASK(CRCSHIFTH), 6, b
#define SHFT15                           BANKMASK(CRCSHIFTH), 7, b
#define SHFT2                            BANKMASK(CRCSHIFTL), 2, b
#define SHFT3                            BANKMASK(CRCSHIFTL), 3, b
#define SHFT4                            BANKMASK(CRCSHIFTL), 4, b
#define SHFT5                            BANKMASK(CRCSHIFTL), 5, b
#define SHFT6                            BANKMASK(CRCSHIFTL), 6, b
#define SHFT7                            BANKMASK(CRCSHIFTL), 7, b
#define SHFT8                            BANKMASK(CRCSHIFTH), 0, b
#define SHFT9                            BANKMASK(CRCSHIFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SMP                              BANKMASK(SPI1CON1), 7, b
#define SMT1AS                           BANKMASK(SMT1STAT), 0, b
#define SMT1CPOL                         BANKMASK(SMT1CON0), 2, b
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0, b
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1, b
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2, b
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3, b
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4, b
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5, b
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6, b
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7, b
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0, b
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1, b
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2, b
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3, b
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2, b
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4, b
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5, b
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6, b
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7, b
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3, b
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4, b
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5, b
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6, b
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7, b
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0, b
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1, b
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7, b
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0, b
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1, b
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2, b
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3, b
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4, b
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5, b
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6, b
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7, b
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0, b
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1, b
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2, b
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3, b
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2, b
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4, b
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5, b
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6, b
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7, b
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3, b
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4, b
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5, b
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6, b
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7, b
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0, b
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1, b
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6, b
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0, b
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1, b
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2, b
#define SMT1EN                           BANKMASK(SMT1CON0), 7, b
#define SMT1GO                           BANKMASK(SMT1CON1), 7, b
#define SMT1IE                           BANKMASK(PIE1), 5, b
#define SMT1IF                           BANKMASK(PIR1), 5, b
#define SMT1IP                           BANKMASK(IPR1), 5, b
#define SMT1MD                           BANKMASK(PMD6), 5, b
#define SMT1PR0                          BANKMASK(SMT1PRL), 0, b
#define SMT1PR1                          BANKMASK(SMT1PRL), 1, b
#define SMT1PR10                         BANKMASK(SMT1PRH), 2, b
#define SMT1PR11                         BANKMASK(SMT1PRH), 3, b
#define SMT1PR12                         BANKMASK(SMT1PRH), 4, b
#define SMT1PR13                         BANKMASK(SMT1PRH), 5, b
#define SMT1PR14                         BANKMASK(SMT1PRH), 6, b
#define SMT1PR15                         BANKMASK(SMT1PRH), 7, b
#define SMT1PR16                         BANKMASK(SMT1PRU), 0, b
#define SMT1PR17                         BANKMASK(SMT1PRU), 1, b
#define SMT1PR18                         BANKMASK(SMT1PRU), 2, b
#define SMT1PR19                         BANKMASK(SMT1PRU), 3, b
#define SMT1PR2                          BANKMASK(SMT1PRL), 2, b
#define SMT1PR20                         BANKMASK(SMT1PRU), 4, b
#define SMT1PR21                         BANKMASK(SMT1PRU), 5, b
#define SMT1PR22                         BANKMASK(SMT1PRU), 6, b
#define SMT1PR23                         BANKMASK(SMT1PRU), 7, b
#define SMT1PR3                          BANKMASK(SMT1PRL), 3, b
#define SMT1PR4                          BANKMASK(SMT1PRL), 4, b
#define SMT1PR5                          BANKMASK(SMT1PRL), 5, b
#define SMT1PR6                          BANKMASK(SMT1PRL), 6, b
#define SMT1PR7                          BANKMASK(SMT1PRL), 7, b
#define SMT1PR8                          BANKMASK(SMT1PRH), 0, b
#define SMT1PR9                          BANKMASK(SMT1PRH), 1, b
#define SMT1PRAIE                        BANKMASK(PIE1), 6, b
#define SMT1PRAIF                        BANKMASK(PIR1), 6, b
#define SMT1PRAIP                        BANKMASK(IPR1), 6, b
#define SMT1PS0                          BANKMASK(SMT1CON0), 0, b
#define SMT1PS1                          BANKMASK(SMT1CON0), 1, b
#define SMT1PWAIE                        BANKMASK(PIE1), 7, b
#define SMT1PWAIF                        BANKMASK(PIR1), 7, b
#define SMT1PWAIP                        BANKMASK(IPR1), 7, b
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6, b
#define SMT1RESET                        BANKMASK(SMT1STAT), 5, b
#define SMT1RST                          BANKMASK(SMT1STAT), 5, b
#define SMT1SPOL                         BANKMASK(SMT1CON0), 3, b
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0, b
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1, b
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2, b
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3, b
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4, b
#define SMT1STP                          BANKMASK(SMT1CON0), 5, b
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0, b
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1, b
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2, b
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3, b
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4, b
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5, b
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6, b
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7, b
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0, b
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1, b
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2, b
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3, b
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2, b
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4, b
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5, b
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6, b
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7, b
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3, b
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4, b
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5, b
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6, b
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7, b
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0, b
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1, b
#define SMT1TS                           BANKMASK(SMT1STAT), 2, b
#define SMT1WOL                          BANKMASK(SMT1CON0), 4, b
#define SMT1WS                           BANKMASK(SMT1STAT), 1, b
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0, b
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1, b
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2, b
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3, b
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SOSIE                            BANKMASK(SPI1INTE), 5, b
#define SOSIF                            BANKMASK(SPI1INTF), 5, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE2), 6, b
#define SPI1IF                           BANKMASK(PIR2), 6, b
#define SPI1IP                           BANKMASK(IPR2), 6, b
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD5), 2, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE2), 4, b
#define SPI1RXIF                         BANKMASK(PIR2), 4, b
#define SPI1RXIP                         BANKMASK(IPR2), 4, b
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE2), 5, b
#define SPI1TXIF                         BANKMASK(PIR2), 5, b
#define SPI1TXIP                         BANKMASK(IPR2), 5, b
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPOL                             BANKMASK(SMT1CON0), 3, b
#define SRMTIE                           BANKMASK(SPI1INTE), 7, b
#define SRMTIF                           BANKMASK(SPI1INTF), 7, b
#define SSEL0                            BANKMASK(SMT1SIG), 0, b
#define SSEL1                            BANKMASK(SMT1SIG), 1, b
#define SSEL2                            BANKMASK(SMT1SIG), 2, b
#define SSEL3                            BANKMASK(SMT1SIG), 3, b
#define SSEL4                            BANKMASK(SMT1SIG), 4, b
#define SSET                             BANKMASK(SPI1CON2), 2, b
#define SSFLT                            BANKMASK(SPI1CON2), 6, b
#define SSP                              BANKMASK(SPI1CON1), 2, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STP                              BANKMASK(SMT1CON0), 5, b
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
